Revit 2023 API
AreaBasedLoadData Methods
The AreaBasedLoadData type exposes the following members.
Methods
Name | Description
AddElectricalLoadArea
 Adds electrical load area into the area based load.
Dispose |  (Inherited from ZoneElementDomainData.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetElectricalLoadAreas
 Gets electrical load areas which the area based load includes.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
RemoveElectricalLoadArea
 Removes electrical load area from the area based load.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace